Revit 2027 API
Document Properties
The Document type exposes the following members.
Properties
Name | Description
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Top
See Also
Reference
Document Class
Autodesk.Revit.Creation Namespace